# Exploratory data analysis

### 1. Import librariesz

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### 2. Load dataset

In [2]:
df = pd.read_csv("../data/train_E6oV3lV.csv")
df.head(5)

   id  label                                              tweet
0   1      0   @user when a father is dysfunctional and is s...
1   2      0  @user @user thanks for #lyft credit i can't us...
2   3      0                                bihday your majesty
3   4      0  #model   i love u take with u all the time in ...
4   5      0             factsguide: society now    #motivation

### 3. Check dataset

In [3]:
df.shape

(31962, 3)

In [4]:
df.dtypes

id        int64
label     int64
tweet    object
dtype: object

In [5]:
df.describe()

                 id         label
count  31962.000000  31962.000000
mean   15981.500000      0.070146
std     9226.778988      0.255397
min        1.000000      0.000000
25%     7991.250000      0.000000
50%    15981.500000      0.000000
75%    23971.750000      0.000000
max    31962.000000      1.000000

### 4. Check duplicate rows

In [8]:
tmp = df.duplicated(subset=df.columns.tolist(), keep=False)
duplicated_rows = df[tmp]
duplicated_rows

Empty DataFrame
Columns: [id, label, tweet]
Index: []

### 5. Check missing or null values

In [9]:
df.isnull().sum()

id       0
label    0
tweet    0
dtype: int64